[
  {
    "author": "Charles Dickens",
    "book_name": "Great Expectations",
    "description": "One of the finest novels by iconic British author Charles Dickens, this Victorian tale follows the good-natured orphan Pip as he makes his way through life. As a boy, Pip crosses paths with a convict named Magwitch, a man who will heavily influence Pip's adulthood. Meanwhile, the earnest young man falls for the beautiful Estella, the adoptive daughter of the affluent and eccentric Miss Havisham. Widely considered to be Dickens's last great book, the story is steeped in romance and features the writer's familiar themes of crime, punishment, and societal struggle.",
    "img_url": "https://books.google.co.uk/books/content?id=fhUXAAAAYAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE71r_9TMmAI-r8XPo4T3dAwal5MZhNld-nd6SrR5D-MzZDXy_iFeZrWO11CRIr0OHEOKIEVqE32U21R_-TAWh_wBwiDMRRT5LAWR8L6JMqZHR-990rm5ZKKwQDfjlc9gbsE7VwTA"
  },
  {
    "author": "Louisa May Alcott",
    "book_name": "Little Women",
    "description": "Lovely Meg, talented Jo, frail Beth, spoiled Amy: these are hard lessons of poverty and of growing up in New England during the Civil War. Through their dreams, plays, pranks, letters, illnesses, and courtships, women of all ages have become a part of this remarkable family and have felt the deep sadness when Meg leaves the circle of sisters to be married at the end of Part I. Part II, chronicles Meg's joys and mishaps as a young wife and mother, Jo's struggle to become a writer, Beth's tragedy, and Amy's artistic pursuits and unexpected romance. Based on Louisa May Alcott's childhood, this lively portrait of nineteenth- century family life possesses a lasting vitality that has endeared it to generations of readers.  For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
    "img_url": "https://books.google.co.uk/books/content?id=MO3SEL6qIsgC&printsec=frontcover&img=1&zoom=1&imgtk=AFLRE70ZjENpuEi07fm3jw3KvTDeWVbF9hIh70DVQP5mxAJ3wBYwVmYAaFSENGMbdQ_tpL9YCk0d4JpeToHInsRWGHeHg0QZ74hpNei1TVR-jOG4sZxkqIcIpt4eH4DDDGTa09UfFTfd"
  }
]
